USE BookMS;

INSERT INTO USERLEVEL
VALUES('professor',20,60),   #教师
  ('undergraduate',5,30),  #本科生
  ('graduate',10,20),      #研究生
  ('doctor',10,10);        #博士

INSERT INTO READER
  VALUES('13307130337','1111','韩佩儒','13307130337@fudan.edu.cn','undergraduate');

INSERT INTO OFFICER
  VALUES('0001','1111','工作人员A','officer1@bookms.com');

INSERT INTO ADMIN
  VALUES('1001','1111','管理员A','admin1@bookms.com');

INSERT INTO BOOKINFO
VALUES('9787532752164','I712.45 /F37N','那些忧伤的年轻人','(美) F·S·菲茨杰拉德','上海 : 上海译文出版社', 2010),
  ('9787020046089','I712.45 /F37L=3','了不起的盖茨比','(美) F·S·菲茨杰拉德','北京 : 人民文学出版社', 2004),
  ('7532731146','I712.45 /S811C','人与鼠','(美) 斯坦贝克·J','上海 : 上海译文出版社',2004),
  ('9787111294504','TP391.41 /S523B','OpenGL编程指南','施赖纳 (Shreiner, Dave)','北京 : 机械工业出版社',2010);

INSERT INTO SINGLEBOOK
  VALUES('B130604399234C','9787532752164','文科馆四楼文科书库', 1, 1),
      ('B0507033930536','7532731146','张江馆张江书库', 0, 1),
      ('B0507033941112','7532731146','文科馆四楼文科书库', 0, 1),
      ('B0411033086655','9787020046089','文科馆四楼文科书库', -1, 1),
      ('B0411033086644','9787020046089','江湾1号密集书库', 0, 0),
      ('B1010039847528','9787111294504','张江馆张江书库', 1, 1);

INSERT INTO BORROWINFO
  VALUES('00000001','13307130337','B130604399234C', '2015-05-15', '2015-07-15', 0),
      ('00000002','13307130337','B1010039847528', '2015-05-15', '2015-07-15', 0);
